#+BEGIN_COMMENT
.. title: Shell Scripts and Interactive Shell
.. slug: shell-scripts-and-interactive-shell
.. date: 2020-02-22 09:45:37 UTC+01:00
.. tags: Unix
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT


Today I came accross a nice way to write and append information to a
document. This is particularly useful when making tutorial and
writing instructions for folks that do work with emacs or any proper
text editor.

Instead of working with =nano= you can simply write multiple lines
directly in your shell leveraging the ~<<~ delimiter condition and
passing the input to a document of interest.

{{{TEASER_END}}}

In this sense instead of changing for instance your =.bashrc=
configuration file by running

#+BEGIN_SRC sh
 echo "export NVM_DIR='$HOME/.nvm'" >> ~/.bashrc
 echo "[ -s '$NVM_DIR/nvm.sh' ] && \. '$NVM_DIR/nvm.sh'  # This loads nvm" >> ~/.bashrc
 echo "[ -s '$NVM_DIR/bash_completion' ] && \. '$NVM_DIR/bash_completion'  # This loads nvm bash_completion" >> ~/.bashrc
#+END_SRC

You can change it in one go through the use of the delimiter
condition. 

To understand this consider the following.

#+BEGIN_SRC sh
echo "#!/bin/sh" >> ~/Desktop/example.txt

cat ~/Desktop/example.txt
#+END_SRC

#+RESULTS:
| #!/bin/sh |

#+BEGIN_SRC sh
cat << 'Change_File' >> ~/Desktop/example.txt
echo "I like this new feature.
It is quite handy for modifiying 
documents directly from the shell."
Change_File
#+END_SRC

#+RESULTS:

You will see now that the entire echo command was appended to the
shell script. You can now run it after changing the permission of the
file to an executable file.

#+BEGIN_SRC sh :results output
chmod u+x ~/Desktop/example.txt

~/Desktop/example.txt
#+END_SRC

#+RESULTS:
: I like this new feature.
: It is quite handy for modifiying 
: documents directly from the shell.

In the example above you can then change the above multiline command
with lots of redundancy to the more straightforward command

#+BEGIN_SRC sh
cat << 'Append_Bash' >> ~/.bashrc

export NVM_DIR='$HOME/.nvm'
[ -s '$NVM_DIR/nvm.sh' ] && \. '$NVM_DIR/nvm.sh'  # This loads nvm 
[ -s '$NVM_DIR/bash_completion' ] && \. '$NVM_DIR/bash_completion'  # This loads nvm bash_completion
Append_Bash
#+END_SRC

#+RESULTS:
